OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBD_Mass_Storage_CDROM/MassStorage.c
void MSC_ReadTOC(void)
{
    uint32_t u32Len;
    uint8_t u8format = (g_sCBW.u8LUN & 0x0F) | (g_sCBW.au8Data[7] >> 6);

    if(g_sCBW.u8LUN == 0x02)
    {
        switch(u8format)
        {
            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if(u32Len > sizeof(g_au8ReadTOC_MSF0))
                    u32Len = sizeof(g_au8ReadTOC_MSF0);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            case 0x02:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if(u32Len > sizeof(g_au8ReadTOC_MSF2))
                    u32Len = sizeof(g_au8ReadTOC_MSF2);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF2, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
        }
    }
    else if(g_sCBW.u8LUN == 0x00)
    {
        switch(g_sCBW.au8Data[0])
        {
            case 0x01:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if(u32Len > sizeof(g_au8ReadTOC_LBA1))
                    u32Len = sizeof(g_au8ReadTOC_LBA1);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA1, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if(u32Len > sizeof(g_au8ReadTOC_LBA0))
                    u32Len = sizeof(g_au8ReadTOC_LBA0);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
                break;
        }
    }
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;

        USBD_SET_EP_STALL(EP2);
        g_u8Prevent = 1;
        g_sCSW.bCSWStatus = 0x01;
        g_sCSW.dCSWDataResidue = 0;
        g_u8BulkState = BULK_IN;
        MSC_AckCmd();
        return;
    }
}

void MSC_GetConfiguration(uint32_t u32Len, uint8_t *pu8Buff)
{
    uint32_t u32Index, u32FeatureLen;
    uint8_t  *pu8Ptr;

    if(g_u8Remove)
    {
        memset((int8_t *)pu8Buff, 0, u32Len);
        return;
    }

    if(g_sCBW.u8LUN == 0x02)
    {
        memcpy(pu8Buff, g_au8GetConfiguration, 8);
        u32FeatureLen = 0;
        // the first feature on the array
        u32Index = 8;

        // find the specified feature
        while(u32Index < sizeof(g_au8GetConfiguration))
        {
            if((g_au8GetConfiguration[u32Index] == g_sCBW.au8Data[0]) && (g_au8GetConfiguration[u32Index + 1] == g_sCBW.au8Data[1]))
            {
                // copy the feature
                u32FeatureLen = g_au8GetConfiguration[u32Index + 3] + 4;
                memcpy(pu8Buff + 8, &g_au8GetConfiguration[u32Index], u32FeatureLen);
                break;
            }
            else
            {
                u32Index += (g_au8GetConfiguration[u32Index + 3] + 4);
            }
        }
        // fix up return length
        u32Len = 8 + u32FeatureLen;
        pu8Buff[3] = u32Len - 4;
    }
    else if(g_sCBW.u8LUN == 0x01)
    {
        memcpy(pu8Buff, g_au8GetConfiguration, 8);
        pu8Ptr = pu8Buff + 8;

        // the first feature on the array
        u32Index = 8;

        // find current features
        while(u32Index < sizeof(g_au8GetConfiguration))
        {
            u32FeatureLen = g_au8GetConfiguration[u32Index + 3] + 4;
            if(g_au8GetConfiguration[u32Index + 2] & 0x01)     // check current bit
            {
                memcpy(pu8Ptr, &g_au8GetConfiguration[u32Index], u32FeatureLen);
                pu8Ptr += u32FeatureLen;
            }
            u32Index += u32FeatureLen;
        }
        u32Len = pu8Ptr - pu8Buff;
        pu8Buff[3] = u32Len - 4;
    }
    else if(g_sCBW.u8LUN == 0x00)
        memcpy((char *)pu8Buff, &g_au8GetConfiguration[0], sizeof(g_au8GetConfiguration));
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;
    }
}

void MSC_GetEventStatusNotification(void)
{
    uint32_t u32Len;

    u32Len = g_sCBW.dCBWDataTransferLength;
    if(u32Len > 8)
        u32Len = 8;

    g_u8BulkState = BULK_IN;
    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8GetEventStatusNotification_01, u32Len);
    /* Trigger to send out the data packet */
    USBD_SET_PAYLOAD_LEN(EP2, u32Len);
}

void MSC_RequestSense(void)
{
    uint8_t au8Tmp[20];

    memset(au8Tmp, 0, 18);
    if(g_u8Prevent)
    {
        g_u8Prevent = 0;
        au8Tmp[0] = 0x70;
    }
    else
        au8Tmp[0] = 0xf0;

    au8Tmp[2] = g_au8SenseKey[0];
    au8Tmp[7] = 0x0a;
    au8Tmp[12] = g_au8SenseKey[1];
    au8Tmp[13] = g_au8SenseKey[2];
    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), au8Tmp, 20);

    g_au8SenseKey[0] = 0;
    g_au8SenseKey[1] = 0;
    g_au8SenseKey[2] = 0;
}

void MSC_ReadFormatCapacity(void)
{
    memset((uint8_t *)MassCMD_BUF, 0, 12);

    *((uint8_t *)(MassCMD_BUF + 0)) = 0x00;
    *((uint8_t *)(MassCMD_BUF + 1)) = 0x00;
    *((uint8_t *)(MassCMD_BUF + 2)) = 0x00;
    *((uint8_t *)(MassCMD_BUF + 3)) = 0x08;                    /* Capacity List Length */

    /* Block Count */
    *((uint8_t *)(MassCMD_BUF + 4)) = (g_i32TotalSectors >> 24) & 0xFF;
    *((uint8_t *)(MassCMD_BUF + 5)) = (g_i32TotalSectors >> 16) & 0xFF;
    *((uint8_t *)(MassCMD_BUF + 6)) = (g_i32TotalSectors >>  8) & 0xFF;
    *((uint8_t *)(MassCMD_BUF + 7)) = (g_i32TotalSectors >>  0) & 0xFF;

